/*CREATE DATABASE myproject;*/
USE myproject;

DROP TABLE charDict;
CREATE TABLE charDict(
ID INT unsigned NOT NULL AUTO_INCREMENT,
Standard NVARCHAR(50) NOT NULL,
Meaning VARCHAR(50) NOT NULL,
JapaneseOnyomi NVARCHAR(50) NOT NULL,
JapaneseKunyomi NVARCHAR(50) NOT NULL,
Korean NVARCHAR(20) NOT NULL,
Chinese NVARCHAR(20) NOT NULL,
TradChar NVARCHAR(50) DEFAULT NULL /*Changed from 0 to default null */,
SimpChar NVARCHAR(50) DEFAULT NULL,
PRIMARY KEY (ID)
);

INSERT INTO charDict (Standard, Meaning, JapaneseOnyomi, JapaneseKunyomi, Korean, Chinese)
VALUES /*All grade one characters */ 
('一', 'One', 'イチ、イツ', 'ひと', '일', 'yī'),
('右', 'Right', 'ウ、ユウ', 'みぎ', '우', 'yòu'),
('雨', 'Rain', 'ウ', 'あめ', '우', 'yǔ'),
('円', 'Round, Yen', 'エン', 'まる', '엔', 'yuán'),
('王', 'King', 'オウ', '-', '왕', 'wáng'),
('音', 'Sound', 'オン、イン', 'おと、ね', '음', 'yīn'),
('下', 'Below', 'カ、ゲ', 'した、しも、もと、さ、くだ、お', '하', 'xià'),
('火', 'Fire', 'カ', 'ひ', '화', 'huǒ'),
('花', 'Flower', 'カ', 'はな', '화', 'huā'),
('貝', 'Shellfish', '-', 'かい', '페', 'bèi'),
('学', 'Study', 'ガク', 'まな', '학', 'xué'),
('気', 'Feeling', 'キ、ケ', '-', '기', 'qì'),
('九', 'Nine', 'キュウ、ク', 'ここの', '구', 'jiǔ'),
('休', 'Rest', 'キュウ', 'やす', '휴', 'xiū'),
('玉', 'Ball', 'ギョク', 'たま', '-', 'yù'),
('金', 'Gold', 'キン、コン', 'かね', '금', 'jīn'),
('空', 'Sky', 'クウ', 'そら、あ、から', '천', 'tiān'),
('月', 'Month, Moon', 'ゲツ、ガツ', 'つき', '월', 'yuè'),
('犬', 'Dog', 'ケン', 'いぬ', '견', 'quǎn'),
('見', 'See', 'ケン', 'み', '견', 'jiàn'),
('五', 'Five', 'ゴ', 'いつ', '오', 'wǔ'),
('口', 'Mouth', 'コウ、ク', 'くち', '구', 'kǒu'),
('校', 'School', 'コウ', '-', '교', 'xiào'),
('左', 'Left', 'サ', 'ひだり', '좌', 'zuǒ'),
('三', 'Three', 'サン', 'み、みっ', '산', 'sān'),
('山', 'Mountain', 'サン', 'やま', '산', 'shān'),
('子', 'Child', 'シ、ス', 'こ', '자', 'zǐ'),
('四', 'Four', 'シ', 'よ、よっ、よん', '사', 'sì'),
('糸', 'Thread', 'シ', 'いと', '', 'mì'),
('字', 'Letter', 'ジ', 'あざ', '자', 'zì'),
('耳', 'Ear', 'ジ', 'みみ', '이', 'ěr'),
('七', 'Seven', 'シチ', 'なな', '칠', ' qī '),
('車', 'Car', 'シャ', 'くるま', '거,차', 'chē'),
('手', 'Hand', 'シュ', 'て', '수', 'shǒu'),
('十', 'Ten', 'ジュウ、ジッ', 'とお', '십', 'shí'),
('出', 'Exit', 'シュツ', 'で、だ', '출', 'chū'),
('女', 'Woman', 'ジョ、ニョ（ニョウ）', 'おんな', '녀(여)', 'nǚ'),
('小', 'Small', 'ショウ', 'ちい、お', '소', 'xiǎo'),
('上', 'Up', 'ジョウ（ショウ）', 'うえ（うわ）、かみ、あ、のぼ', '상', 'shàng, shǎng'),
('森', 'Forest', 'シン', 'もり', '삼', 'sēn'),
('人', 'Person', 'ジン、ニン', 'ひと', '인', 'rén'),
('水', 'Water', 'スイ', 'みず', '수', 'shuǐ'),
('正', 'Correct', 'セイ、ショウ', 'ただ、まさ', '정', 'zhèng, zhēng'),
('生', 'Life', 'セイ、ショウ', 'い、う、お、は、き、なま', '생', 'shēng'),
('青 (靑)', 'Blue', 'セイ（ショウ）', 'あお', '청', 'qīng'),
('夕', 'Evening', 'セキ', 'ゆう', '석', 'xī'),
('石', 'Stone', 'セキ', 'いし', '석', 'shí'),
('赤', 'Red', 'セキ（シャク）', 'あか', '적', 'chì'),
('千', 'Thousand', 'セン', 'ち', '천', 'qiān'),
('川', 'River', 'セン', 'かわ', '천', 'chuān'),
('先', 'Previous', 'セン', 'さき', '선', 'xiān'),
('早', 'Early', 'ソウ', 'はや', '조', 'zǎo'),
('草', 'Grass', 'ソウ', 'くさ', '초', 'cǎo'),
('足', 'Foot', 'ソク', 'あし、た', '족', 'zú, jù'),
('村', 'Village', 'ソン', 'むら', '촌', 'cūn'),
('大', 'Big', 'ダイ、タイ', 'おお', '대', 'dà'),
('男', 'Boy', 'ダン、ナン', 'おとこ', '남', 'nán'),
('竹', 'Bamboo', 'チク', 'たけ', '죽', 'zhú'),
('中', 'Middle', 'チュウ（ジュウ）', 'なか', '중', 'zhōng'),
('虫 (蟲 Trad.)', 'Insect', 'チュウ', 'むし', '충', 'chóng'),
('町', 'Town', 'チョウ', 'まち', '정', 'tīng, dīng'),
('天', 'Heaven', 'テン', 'あめ（あま）', '천', 'tiān'),
('田', 'Rice paddy', 'デン', 'た', '전', 'tián'),
('土', 'Soil', 'ド、ト', 'つち', '토', 'tǔ'),
('二', 'Two', 'ニ', 'ふた', '이', 'èr'),
('日', 'Day', 'ニチ、ジツ', 'ひ、か', '일', 'rì'),
('入', 'Enter', 'ニュウ', 'い、はい', '입', 'rù'),
('年', 'Year', 'ネン', 'とし', '년', 'nián'),
('白', 'White', 'ハク、ビャク', 'しろ', '백', 'bái'),
('八', 'Eight', 'ハチ', 'や、やっ', '팔', 'bā'),
('百', 'Hundred', 'ヒャク', '-', '백', 'bǎi'),
('文', 'Writing', 'ブン、モン', 'ふみ', '문', 'wén'),
('木', 'Tree', 'ボク、モク', 'き', '목', 'mù'),
('本', 'Book', 'ホン', 'もと', '본', 'běn'),
('名', 'Name', 'メイ、ミョウ', 'な', '명', 'míng'),
('目', 'Eye', 'モク（ボク）', 'め（ま）', '목', 'mù'),
('立', 'Stand up', 'リツ', 'た', '립(입)', 'lì'),
('力', 'Power', 'リョク、リキ', 'ちから', '력(역)', 'lì'),
('林', 'Woods', 'リン', 'はやし', '림(임)', 'lín'),
('六', 'Six', 'ロク', 'む、むっ', '륙, 육', 'liù'),

/*Grade 2 characters*/

('引', 'Pull, Draw', 'イン', 'ひ', '인', 'yǐn'),
('羽', 'Feather', 'ウ', 'はね、は', '운', 'yǔ'),
('雲 (云)', 'Cloud', 'ウン', 'くも', '운', 'yún'),
('園', 'Garden', 'エン', 'その', '원', 'yuán'),
('遠 (远)', 'Far', 'エン', 'とお', '원', 'yuàn'),
('何', 'What', 'カ', 'なに', '하', 'hé'),
('科', 'Course, Section', 'カ', '-', '과', 'kē'),
('夏', 'Summer', 'カ（ゲ）', 'なつ', '하', 'xià'),
('家', 'House, Family', 'カ、ケ', 'いえ、や', '가', 'jiā'),
('歌', 'Song', 'カ', 'うた', '가', 'gē'), 
('画　（畫）', 'Picture, Drawing', 'ガ、カク', '-', '획', 'huà'),
('回', '-times', 'カイ', 'まわ', '회', 'huí'),
('会', 'Meeting, Association', 'カイ、エ', 'あ', '회', 'huì'),
('海', 'Sea', 'カイ', '海', '해', 'hǎi'),
('絵', 'Picture, Painting', 'カイ、エ', '-', '회', 'huì'),
('外', 'Outside, Foreign', 'ガイ、ゲ', 'そと、ほか、はず', '외', 'wài'),
('角', 'Angle, Corner, Horn', 'カク', 'かど、つの', '각', 'jiǎo, jué'),
('楽 (樂) (乐)', 'Pleasure', 'ガク、ラク', 'たの', '락(낙), 악', 'yuè, lè'),
('活', 'Active', 'カツ', 'い', '활', 'huó'),
('間 (间)', 'Interval, Space(between things)', 'カン、ケン', 'あいだ、ま', '간', 'jiān, jiàn'),
('丸', 'Round, Circle', 'ガン', 'まる', '환', 'wán'),
('岩', 'Boulder', 'ガン', 'いわ', '암', 'yán'),
('顔 (颜)', 'Face', 'ガン', 'かお', '안', 'yán'),
('汽', 'Steam', 'キ', '-', '기', 'qì'),
('記 (记)', 'Write down', 'キ', 'しる', '기', 'jì'),
('帰 (歸) (归)', 'Return', 'キ', 'かえ', '귀', 'guī'),
('弓', 'Bow', 'キュウ', 'ゆみ', '궁', 'gōng'),
('牛', 'Cow', 'ギュウ', 'うし', '우', 'niú'),
('魚', 'Fish', 'ギョ', 'さかな、うお', '어', 'yú'),
('京', 'Capital', 'キョウ、ケイ', '-', '경', 'jīng'),
('強 (强)', 'Strong', 'キョウ、ゴウ', 'つよ、し', '강', 'qiáng, qiǎng, jiàng'),
('教', 'Teach', 'キョウ', 'おし、おそ', '교', 'jiāo, jiào'),
('近', 'Near, Close', 'キン', 'ちか', '근', 'jìn'),
('兄', 'Older brother', 'ケイ（キョウ）', 'あに', '형', 'xiōng'),
('形', 'Shape, Style', 'ケイ、ギョウ', 'かたち、かた', '형', 'xíng'),
('計 (计)', 'Measure, Plan', 'ケイ', 'はかる、はか', '계', 'jì'),
('元', 'Origin, Former', 'ゲン、ガン', 'もと', '원', 'yuán'),
('言', 'Say, Word', 'ゲン、ゴン', 'い、こと', '언', 'yán'),
('原', 'Original, Field', 'ゲン', 'はら', '원', 'yuán'),
('戸', 'Door', 'コ', 'と', '호', 'hù'),
('古', 'Old', 'コ', 'ふる', '고', 'gǔ'),
('午', 'Noon', 'ゴ', '-', '오', 'wǔ'),
('後 (后)', 'Behind, After, Back', 'ゴ、コウ', 'あと、うしろ、おち、おく', '후', 'hòu'),
('語 (语)', 'Language', 'ゴ', 'かた', '어', 'yù'),
('工', 'Construction, Manufacture', 'コウ、ク', '', '공', 'gōng'),
('公', 'Public', 'コウ', 'おおやけ', '공', 'gōng'),
('広 (廣)(广)', 'Wide', 'コウ', 'ひろ', '광', 'guǎng'),
('交', 'Mix, Interchange', 'コウ', 'まじ、ま、か', '교', 'jiāo'),
('光', 'Light', 'コウ', 'ひかり、ひか', '광', 'guāng'),
('考', 'Think, Consider', 'コウ', 'かんが', '고', 'kǎo'),
('行', 'Go', 'コウ、ギョウ（アン）', 'い、ゆ、おこな', '행', 'xíng, háng'),
('高', 'Tall, Expensive', 'コウ', 'たか', '고', 'gāo'),
('黄', 'Yellow', 'コウ、オウ', 'き（こ）', '황', 'huáng'),
('合', 'Fit, Suit, Join', 'ゴウ、ガッ（カツ）', 'あ', '합', 'hé'),
('谷', 'Valley', 'コク', 'たに', '곡', 'gǔ'),
('国 (國)', 'Country', 'コク', 'くに', '국', 'guó'),
('黒 (黑)', 'Black', 'コク', 'くろ', '흑', 'hēi'),
('今', 'Now', 'コン、キン', 'いま', '금', 'jīn'),
('才', 'Talent', 'サイ', '', '재', 'cái'),
('細 (细)', 'Thin, Narrow', 'サイ', 'ほそ、こま', '세', 'xì'),
('作', 'Make', 'サク、サ', 'つく', '작', 'zuò'),
('算', 'Calculate', 'サン', '-', '산', 'suàn'),
('止', 'Stop', 'シ', 'と', '지', 'zhǐ'),
('市', 'Market, City', 'シ', 'いち', '시', 'shì'),
('矢', 'Arrow', 'シ', 'や', '시', 'shǐ'),
('姉 (姊)', 'Older sister', 'シ', 'あね', '자', 'zǐ'),
('思', 'Think', 'シ', 'おも', '사', 'sī'),
('紙', 'Paper', 'シ', 'かみ', '지', 'zhǐ'),
('寺', 'Buddhist temple', 'ジ', 'てら', '사', 'sì'),
('自', 'Self', 'シ、ジ', 'みずか', '자', 'zì'),
('時 (时)', 'Time', 'ジ', 'とき', '시', 'shí'),
('室', 'Room', 'シツ', 'むろ', '실', 'shì'),
('社', 'Company, Shrine', 'シャ', 'やしろ', '사', 'shè'),
('弱', 'Weak', 'ジャク', 'よわ', '약', 'ruò'),
('首', 'Neck, Leader', 'シュ', 'くび', '수', 'shǒu'),
('秋', 'Fall, Autumn', 'シュウ', 'あき', '추', 'qiū'),
('週 (周)', 'Week', 'シュウ', '-', '주', 'zhōu'),
('春', 'Spring', 'シュン', 'はる', '춘', 'chūn'),
('書 (书)', 'Write', 'ショ', 'か', '주', 'shū'),
('少', 'Little, Few', 'ショウ', 'すこ、すく', '소', 'shào'),
('場 (场)', 'Place', 'ジョウ', 'ば', '장', 'chǎng'),
('色', 'Color', 'ショク、シキ', 'いろ', '색', 'sè'),
('食', 'Eat, Meal', 'ショク（ジキ）', 'たべ、く', '시', 'shí'),
('心', 'Heart, Spirit', 'シン', 'こころ', '신', 'xīn'),
('新', 'New', 'シン', 'あたら、あら、にい', '신', 'xīn'),
('親 (亲)', 'Parent, Relative', 'シン', 'おや、した', '친', 'qīn'),
('図 (圖) (图)', 'Map, Plan', 'ズ、ト', 'はか', '도', 'tú'),
('数', 'Number', 'スウ', 'かぞ、かず', '수', 'shù, shǔ, shuò'),
('西', 'West, Spain', 'セイ、サイ', 'にし', '서', 'xī'),
('声', 'Voice', 'セイ（ショウ）', 'こえ', '성', 'shēng'),
('星', 'Star', 'セイ', 'ほし', '성', 'xīng'),
('晴', 'Clear', 'セイ', 'は', '청', 'qíng'),
('切', 'Cut', 'セツ', 'き', '절', 'qiè'),
('雪', 'Snow', 'セツ', 'ゆき', '설', 'xuě'),
('船', 'Boat, Ship', 'セン', 'ふね（ふな）', '선', 'chuán'),
('線 (线)', 'Line, Track', 'セン', '-', '선', 'xiàn'),
('前', 'Front, Before', 'ゼン', 'まえ', '전', 'qián'),
('組 (组)', 'Group, Organization, Assemble', 'ソ', 'くみ、く', '조', 'zǔ'),
('走', 'Run', 'ソウ', 'はし', '주', 'zǒu'),
('多', 'Many', 'タ', 'おお', '다', 'duō'),
('太', 'Thick, Fat', 'タイ、タ', 'ふと', '태', 'tài'),
('体 (體)', 'Body, Form', 'タイ、テイ', 'からだ', '체', 'tǐ'),
('台', 'Platform, A stand', 'ダイ、タイ', '-', '태', 'tái'),
('地', 'Ground, Earth', 'チ、ジ', '-', '지', 'dì, de'),
('池', 'Pond, Reservoir', 'チ', 'いけ', '지', 'chí'),
('知', 'Know', 'チ', 'し', '지', 'zhī'),
('茶', 'Tea', 'チャ、サ', '-', '차, 다', 'chá'),
('昼', 'Daytime, Noon', 'チュウ', 'ひる', '주', 'zhòu'),
('長 (长)', 'Long, Leader', 'チョウ', 'なが', '장', 'cháng, zhǎng'),
('鳥 (鸟)', 'Bird', 'チョウ', 'とり', '조', 'niǎo'),
('朝', 'Morning, Dynasty, North Korea', 'チョウ', 'あさ', '조', 'cháo, zhāo'),
('直', 'Straight, Fix', 'チョク、ジキ', 'なお、ただ', '직', 'zhí'),
('通', 'Pass (through), Commute', 'ツウ（ツ）', 'とお、かよ', '통', 'tōng, tòng'),
('弟', 'Younger brother', 'テイ（ダイ）、（デ）', 'おとうと', '제', 'dì'),
('店', 'Shop, Store', 'テン', 'みせ', '점', 'diàn'),
('点', 'Point, Spot', 'テン', '-', '점', 'diǎn'),
('電 (电)', 'Electricity', 'デン', '-', '전', 'diàn'),
('刀', 'Sword', 'トウ', 'かたな', '도', 'dāo'),
('冬', 'Winter', 'トウ', 'ふゆ', '동', 'dōng'),
('当', 'Appropriate, The present, Hit', 'トウ', 'あ', '당', 'dāng, dàng'),
('東 (东)', 'East', 'トウ', 'ひがし', '동', 'dōng'),
('答', 'Answer', 'トウ', 'こた', '답', 'dá'),
('頭 (头)', 'Head', 'トウ、ズ（ト）', 'あたま、かしら', '두', 'tóu, tou'),
('同', 'Same', 'ドウ', 'おな', '동', 'tóng'),
('道', 'Road, Path', 'ドウ（トウ）', 'みち', '도', 'dào'),
('読 (讀)(读)', 'Read', 'ドク、トク（トウ）', 'よ', '독', 'dú'),
('内', 'Inside', 'ナイ（ダイ）', 'うち', '내', 'nèi'),
('南', 'South', 'ナン', 'みなみ', '남', 'nán'),
('肉', 'Meat', 'ニク', '-', '육', 'ròu'),
('馬 (马)', 'Horse', 'バ', 'うま（ま）', '마', 'mǎ'),
('売 (賣)(卖)', 'Sell', 'バイ', 'う', '매', 'mài'),
('買 (买)', 'Buy', 'バイ', 'か', '매', 'mǎi'),
('麦', 'Wheat', 'バク', 'むぎ', '맥', 'mài'),
('半', 'Half', 'ハン', 'なかば', '반', 'bàn'),
('番', 'Turn', 'バン', '-', '번', 'fān, pān'),
('父', 'Father', 'フ', 'ちち', '부', 'fù'),
('風 (风)', 'Wind, Air, Style', 'フウ', 'かぜ', '풍', 'fēng'),
('分', 'Part, Minute(of time), Understand, Divide', 'フン、ブン', 'わ', '분', 'fēn, fèn'),
('聞 (闻)', 'Hear, Ask, Listen', 'ブン、モン', 'き', '문', 'wén'),
('米', 'Rice, America', 'ベイ、マイ', 'こめ', '미', 'mǐ'),
('歩', 'Walk, Step', 'ホ、ブ（フ）', 'ある、あゆ', '보', 'bù'),
('母', 'Mother', 'ボ', 'はは', '모', 'mǔ'),
('方', 'Direction, Way', 'ホウ', 'かた', '방', 'fāng'),
('北', 'North', 'ホク', 'きた', '북', 'běi'),
('毎 (每)', 'Every', 'マイ', '-', '매', 'měi'),
('妹', 'Younger sister', 'マイ', 'いもうと', '매', 'mèi'),
('万 (萬)', 'Ten thousand', 'マン、バン', '-', '만', 'wàn'),
('明', 'Bright, Clear', 'メイ、ミョウ', 'あ、あか、あき', '명', 'míng'),
('鳴 (鸣)', 'Cry(Animals)', 'メイ', 'な', '명', 'míng'),
('毛', 'Hair, Fur', 'モウ', 'け', '모', 'máo'),
('門', 'Gate', 'モン', 'かど', '문', 'mén'),
('夜', 'Night', 'ヤ', 'よる、よ', '야', 'yè'),
('野', 'Field', 'ヤ', 'の', '야', 'yě'),
('友', 'Friend', 'ユウ', 'とも', '우', 'yǒu'),
('用', 'Use', 'ヨウ', 'もち', '용', 'yòng'),
('曜', 'Day of the week', 'ヨウ', '-', '요', 'yào'),
('来', 'Come, Next', 'ライ', 'く、きた', '래(내)', 'lái'),
('里', 'Village', 'リ', 'さと', '리(이)', 'lǐ'),
('理', 'Reason, Logic', 'リ', '-', '리(이)', 'lǐ'),
('話　(话)', 'Talk, Speak', 'ワ', 'はな、はなし', '화', 'huà');

/*This works for updates! */
UPDATE charDict
SET TradChar = '圓'
WHERE ID = 4;

UPDATE charDict
SET TradChar = '學'
WHERE ID = 11;

UPDATE charDict
SET TradChar = '氣', SimpChar = '气'
WHERE ID = 12;

UPDATE charDict
SET TradChar = '絲'
WHERE ID = 29;

UPDATE charDict
SET SimpChar = '车'
WHERE ID = 33;


/* Print whole table */
SELECT * FROM charDict;


/*Grade 3 characters*/
/*
('悪　（惡）', 'Bad, Evil', 'アク、オ', 'わる', '', ''),
('安　（醫）', 'Cheap', 'アン', 'やす', '', ''),
('暗', 'Dark', 'アン', 'くら', '', ''),
('医', 'Medicine', 'イ', '-', '', ''),
('委', 'Committee', 'イ', 'ゆだ', '', ''),
('意', 'Idea', 'イ', '-', '', ''),
('育', 'Raise, Nurture', 'イク', 'そだ、はぐく', '', ''),
('員', 'Member', 'イン', '-', '', ''),
('院', 'Institution', 'イン', '-', '', ''),
('飲', 'Drink', 'イン', 'の', '', ''),
('運', 'Carry', 'ウン', 'はこ', '', ''),
('泳', 'Swim', 'エイ', 'およ', '', ''),
('駅　（驛）', 'Station', 'エキ', '-', '', ''),
('央', 'Center', 'オウ', '-', '', ''),
('横　（橫）', 'Side', 'オウ', 'よこ', '', ''),
('屋', 'Roof', 'オク', 'や', '', ''),
('温　（溫）', 'Warm', 'オン', 'あたた', '', ''),
('化', 'Change', 'カ、ケ', 'ば', '', ''),
('荷', 'Luggage', 'カ、ニ', '-', '', ''),
('界', 'World', 'カイ', '-', '', ''),
('開', 'Open', 'カイ', 'ひら、あ', '', ''),
('階', 'Floor(of a building)', 'カイ', '-', '', ''),
('寒', 'Cold', 'カン', 'さむ', '', ''),
('感', 'Feeling', 'カン', 'かんじ', '', ''),
('漢　（汉）', 'China', 'カン', '-', '', ''),
('館', 'Public building', 'カン', 'やかた', '', ''),
('岸', 'Beach', 'ガン', 'きし', '', ''),
('起', 'Wake up', 'キ', 'お', '', ''),
('期', 'Period of time', 'キ', '-', '', ''),
('客', 'Guest', 'キャク、カク', '-', '', ''),
('究', 'Research', 'キュウ', 'きわ', '', ''),
('急', 'Hurry, Emergency', 'キュウ', 'いそ', '', ''),
('級（）', 'Level, Rank', 'キュウ', '-', '', ''),
('宮', 'Shinto shrine', 'キュウ、グウ', 'みや', '', ''),
('球', 'Sphere', 'キュウ', 'たま', '', ''),
('去', 'Leave', 'キョ、コ', 'さ', '', ''),
('橋', 'Bridge', 'キョウ', 'はし', '', ''),
('業（）', 'Business', 'ギョウ、ゴウ', 'わざ', '', ''),
('曲', 'Musical composition', 'キョク', 'ま', '', ''),
('局', 'Office', 'キョク', '-', '', ''),
('銀（）', 'Silver', 'ギン', '-', '', ''),
('区　（區）', 'Ward', 'ク', '-', '', ''),
('苦', 'Suffer', 'ク', 'くる、にが', '', ''),
('具', 'Tool', 'グ', '-', '', ''),
('君', 'You', 'クン', 'きみ', '', ''),
('係', 'Person in charge', 'ケイ', 'かか、かかり', '', ''),
('軽（）　（輕）', 'Light', 'ケイ', 'かる', '', ''),
('血', 'Blood', 'ケツ', 'ち', '', ''),
('決', 'Decide', 'ケツ', 'き', '', ''),
('研　（硏）', 'Sharpen, Polish', 'ケン', 'と', '', ''),
('県　（縣）', 'Prefecture', 'ケン', '-', '', ''),
('庫', 'Warehouse', 'コ', '-', '', ''),
('湖', 'Lake', 'コ', 'みずうみ', '', ''),
('向', 'Over there', 'コウ', 'む', '', ''),
('幸', 'Happiness', 'コウ', 'さいわ、さち、しあわ', '', ''),
('港', 'Harbor', 'コウ', 'みなと', '', ''),
('号　（號）', 'Number', 'ゴウ', '', '', ''),
('根', 'Root', 'コン', 'ね', '', ''),
('祭', 'Festival', 'サイ', 'まつ', '', ''),
('皿', 'Dish', '', 'さら', '', ''),
('仕', 'Do', 'シ', 'つか', '', ''),
('死', 'Die', 'シ', 'し', '', ''),
('使', 'Use', 'シ', 'つか', '', ''),
('始', 'Begin', 'シ', 'はじ', '', ''),
('指', 'Finger', 'シ', 'ゆび、さ', '', ''),
('歯　（齒）', 'Tooth', 'シ', 'は', '', ''),
('詩'（）, 'Poem', 'シ', '-', '', ''),
('次', 'Next', 'ジ、シ', 'つ、つぎ', '', ''),
('事（）', 'Abstract thing', 'ジ', 'こと', '', ''),
('持', 'Hold', 'ジ', 'も', '', ''),
('式', 'Style', 'シキ', '-', '', ''),
('実（實）（）', 'Truth', 'ジツ', 'み、みの', '', ''),
('写　（寫）', 'Copy', 'シャ', 'うつ', '', ''),
('者（者）＊', 'Someone', 'シャ', 'もの', '', ''),
('主', 'Master', 'シュ', 'おも、ぬし', '', ''),
('守', 'Protect', 'シュ', 'まも、も', '', ''),
('取', 'Take', 'シュ', 'と', '', ''),
('酒', 'Alcohol', 'シュ', 'さけ', '', ''),
('受', 'Accept', 'ジュ', 'う', '', ''),
('州', 'State', 'シュウ', 'す', '', ''),
('拾', 'Pick up', 'シュウ、ジュウ', 'ひろ', '', ''),
('終', 'End, Finish', 'シュウ', 'お', '', ''),
('習（）', 'Learn', 'シュウ', 'なら', '', ''),
('集', 'Collect', 'シュウ', 'あつ、つど', '', ''),
('住', 'Dwelling*', 'ジュウ', 'す', '', ''),
('重', 'Heavy', 'ジュウ、チョウ', 'おも、かさ、え', '', ''),
('宿', 'Inn', 'シュク', 'やど', '', ''),
('所', 'Place', 'ショ', 'ところ', '', ''),
('暑　（暑）＊', 'Hot', 'ショ', 'あつ', '', ''),
('助', 'Help', 'ジョ', 'たす', '', ''),
('昭', 'Shining', 'ショウ', '', '', ''),
('消', 'Extinguish', 'ショウ', 'け、きえ', '', ''),
('商', 'Sell', 'ショウ', 'あきな', '', ''),
('章', 'Chapter', 'ショウ', '-', '', ''),
('勝', 'Win', 'ショウ', 'か、まさ', '', ''),
('乗　（乘）', 'Ride', 'ジョウ', 'の', '', ''),
('植', 'Plant', 'ショク', 'う', '', ''),
('申', 'Say', 'シン', 'もう', '', ''),
('身', 'Body', 'シン', 'み', '', ''),
('神　（神）', 'God', 'シン、ジン', 'かみ', '', ''),
('真　（眞）', 'True', 'シン', 'ま', '', ''),
('深', 'Deep', 'シン', 'ふか', '', ''),
('進', 'Advance', 'シン', 'すす', '', ''),
('世', 'World', 'セ、セイ', 'よ', '', ''),
('整', 'Order', 'セイ', 'ととの', '', ''),
('昔', 'Long ago', 'セキ（シャク）, 'むかし', '', ''),
('全', 'Whole', 'ゼン', 'すべ、まった', '', ''),
('相', 'Mutual', 'ソウ、ショウ', 'あい', '', ''),
('送', 'Send', 'ソウ', 'おく', '', ''),
('想', 'Concept', 'ソウ', 'おも', '', ''),
('息', 'Breath', 'ソク', 'いき', '', ''),
('速', 'Fast', 'ソク', 'はや、すみ', '', ''),
('族', 'Tribe', 'ゾク', '-', '', ''),
('他', 'Other', 'タ', 'ほか', '', ''),
('打', 'Hit', 'ダ', 'う', '', ''),
('対　（對）', 'Opposite', 'タイ、ツイ', '-', '', ''),
('待', 'Wait', 'タイ', 'ま', '', ''),
('代', 'Substitute', 'ダイ、タイ', 'か、よ、しろ', '', ''),
('第', 'Ordinal number prefix', 'ダイ', '-', '', ''),
('題', 'Topic', 'ダイ', '-', '', ''),
('炭', 'Charcoal', 'タン', 'すみ', '', ''),
('短', 'Short', 'タン', 'みじか', '', ''),
('談', 'Discuss', 'ダン', '-', '', ''),
('着', 'Wear, Arrive', 'チャク（ジャク）', 'き、つ', '', ''),
('注', 'Pour', 'チュウ', 'そそ', '', ''),
('柱', 'Pillar', 'チュウ', 'はしら', '', ''),
('丁', 'Ward', 'チョウ、テイ', '-', '', ''),
('帳', 'Account book*', 'チョウ', '-', '', ''),
('調', 'Investigate', 'チョウ', 'しら、ととの', '', ''),
('追', 'Follow', 'ツイ', 'お', '', ''),
('定', 'Decide', 'テイ、ジョウ', 'さだ', '', ''),
('庭', 'Garden', 'テイ', 'にわ', '', ''),
('笛', 'Flute', 'テキ', 'ふえ', '', ''),
('鉄　（鐵）', 'Iron', 'テツ', '-', '', ''),
('転　（轉）　（）', 'Revolve', 'テン', 'ころ', '', ''),
('都（邑）', 'Metropolis', 'ト、ツ', 'みやこ', '', ''),
('度', 'Degrees', 'ド（ト）', 'たび', '', ''),
('投', 'Throw', 'トウ', 'な', '', ''),
('豆', 'Beans', 'トウ', 'まめ', '', ''),
('島', 'Island', 'トウ', 'しま', '', ''),
('湯', 'Hot water', 'トウ', 'ゆ', '', ''),
('登', 'Climb', 'トウ、ト', 'のぼ', '', ''),
('等', 'Class', 'トウ', 'ひと', '', ''),
('動', 'Move', 'ドウ', 'うご', '', ''),
('童', 'Juvenile', 'ドウ', 'わらべ', '', ''),
('農', 'Farming', 'ノウ', '-', '', ''),
('波', 'Wave', 'ハ', 'なみ', '', ''),
('配', 'Distribute', 'ハイ', 'くば', '', ''),
('倍', 'Double', 'バイ', '-', '', ''),
('箱', 'Box', '', 'はこ', '', ''),
('畑', 'Farm', '', 'はた、はたけ', '', ''),
('発（發）', 'Departure', 'ハツ、ホツ', '-', '', ''),
('反', 'Anti-', 'ハン', 'そ', '', ''),
('坂', 'Slope', 'ハン', 'さか', '', ''),
('板', 'Board', 'ハン、バン', 'いた', '', ''),
('皮', 'Skin', 'ヒ', 'かわ', '', ''),
('悲', 'Sad', 'ヒ', 'かな', '', ''),
('美', 'Beautiful', 'ビ', 'うつく', '', ''),
('鼻', 'Nose', 'ビ', 'はな', '', ''),
('筆', 'Writing brush', 'ヒツ', 'ふで', '', ''),
('氷', 'Ice', 'ヒョウ', 'こおり、ひ', '', ''),
('表', 'Express', 'ヒョウ', 'おもて、あらわ', '', ''),
('秒', 'Second(part of time)', 'ビョウ', '-', '', ''),
('病', 'Sick', 'ビョウ', 'や、やまい', '', ''),
('品', 'Item, Article', 'ヒン', 'しな', '', ''),
('負', 'Lose', 'フ', 'ま、お', '', ''),
('部', 'Part', 'ブ', '-', '', ''),
('服', 'Clothes', 'フク', '-', '', ''),
('福（福）', 'Luck', 'フク', '-', '', ''),
('物', 'Thing', 'ブツ、モツ', 'もの', '', ''),
('平', 'Flat', 'ヘイ、ビョウ', 'たいら、ひら', '', ''),
('返', 'Return', 'ヘン', 'かえ', '', ''),
('勉', 'Exert', 'ベン', '-', '', ''),
('放', 'Release', 'ホウ', 'はな、ほう', '', ''),
('味', 'Flavor', 'ミ', 'あじ', '', ''),
('命', 'Fate, Destiny', 'メイ、ミョウ', 'いのち', '', ''),
('面', 'Face', 'メン', 'おも、おもて、つら', '', ''),
('問', 'Question', 'モン', 'と', '', ''),
('役', 'Service', 'ヤク、エキ', '-', '', ''),
('薬（藥）', 'Medicine', 'ヤク', 'くすり', '', ''),
('由', 'Reason', 'ユ、ユウ', 'よし', '', ''),
('油', 'Oil', 'ユ', 'あぶら', '', ''),
('有', 'Have', 'ユウ、ウ', 'あ', '', ''),
('遊', 'Play', 'ユウ', 'あそ', '', ''),
('予(豫)', 'In advance', 'ヨ', '-', '', ''),
('羊', 'Sheep', 'ヨウ', 'ひつじ', '', ''),
('洋', 'Ocean', 'ヨウ', '-', '', ''),
('葉', 'Leaf', 'ヨウ', 'は', '', ''),
('陽', 'Sunshine', 'ヨウ', '', '', ''),
('様 (樣)()', 'Formal title', 'ヨウ', 'さま', '', ''),
('落', 'Fall, Drop', 'ラク', 'お', '', ''),
('流', 'Stream, Flow', 'リュウ', 'なが', '', ''),
('旅', 'Trip', 'リョ', 'たび', '', ''),
('両(兩)', 'Both', 'リョウ', '-', '', ''),
('緑(綠)', 'Green', 'リョク（ロク）', 'みどり', '', ''),
('礼(禮)', 'Thanks', 'レイ、ライ', '-', '', ''),
('列', 'Row', 'レツ', '-', '', ''),
('練(練)', 'Practice', 'レン', 'ね', '', ''),
('路', 'Road', 'ロ', 'じ', '', ''),
('和', 'Peace', 'ワ', 'やわ、なご', '', ''),

Grade 4

('愛　（）', 'Love', 'アイ', '-', '', ''),
('案', 'Plan', 'アン', '-', '', ''),
('以', 'By means of', 'イ', '-', '', ''),
('衣', 'Clothes', 'イ', 'ころも', '', ''),
('位', 'Rank', 'イ', 'くらい', '', ''),
('囲（圍）', 'Surround', 'イ', 'かこ', '', ''),
('胃', 'Stomach', 'イ', '-', '', ''),
('印', 'Mark', 'イン', 'しるし', '', ''),
('英', 'England', 'エイ', '-', '', ''),
('栄（榮）', 'Prosperity', 'エイ', 'さか、は', '', ''),
('塩（鹽）', 'Salt', 'エン', 'しお', '', ''),
('億', 'Hundred million', 'オク', '-', '', ''),
('加', 'Add', 'カ', 'くわ', '', ''),
('果', 'Fruit', 'カ', 'は', '', ''),
('貨', 'Freight', 'カ', '-', '', ''),
('課', 'Section', 'カ', '-', '', ''),
('芽', 'Bud', 'ガ', 'め', '', ''),
('改', 'Reformation*', 'カイ', 'あらた', '', ''),
('械', 'Contraption*', 'カイ', '-', '', ''),
('害', 'Harm', 'ガイ', '-', '', ''),
('街', 'Street', 'ガイ（カイ）', 'まち', '', ''),
('各', 'Each', 'カク', 'おのおの', '', ''),
('覚（覺）', 'Memorize', 'カク', 'おぼ、さ', '', ''),
('完', 'Perfect', 'カン', '-', '', ''),
('官', 'Government official', 'カン', '-', '', ''),
('管', 'Pipe*', 'カン', 'くだ', '', ''),
('関（關）', 'Related', 'カン', 'せき、かか', '', ''),
('観（觀）', 'Observe', 'カン', 'み', '', ''),
('願', 'Request*', 'ガン', 'ねが', '', ''),
('希', 'Rare*, Hope', 'キ', 'まれ', '', ''),
('季', 'Seasons', 'キ', '-', '', ''),
('紀', 'Chronicle*', 'キ', '-', '', ''),
('喜', 'Rejoice', 'キ', 'よろこ', '', ''),
('旗', 'National flag', 'キ', 'はた', '', ''),
('器（器）', 'Container', 'キ', 'うつわ', '', ''),
('機', 'Machine', 'キ', 'はた', '', ''),
('議', 'Deliberation', 'ギ', '-', '', ''),
('求', 'Request', 'キュウ', 'もと', '', ''),
('泣', 'Cry', 'キュウ', 'な', '', ''),
('救', 'Salvation', 'キョウ', 'すく', '', ''),
('給', 'Salary', 'キュウ', '-', '', ''),
('挙（擧）', 'Raise', 'キョ', 'あ', '', ''),
('漁', 'Fishing', 'ギョ、リョウ', '-', '', ''),
('共', 'Together*', 'キョウ', 'とも', '', ''),
('協', 'Cooperation', 'キョウ', '-', '', ''),
('鏡', 'Mirror', 'キョウ', 'かがみ', '', ''),
('競', 'Compete', 'キョウ、ケイ', 'きそ、せ', '', ''),
('極', 'Poles', 'キョク、ゴク', 'きわ', '', ''),
('訓', 'Instruction', 'クン', '-', '', ''),
('軍', 'Army', 'グン', '-', '', ''),
('郡', 'County', 'グン', '-', '', ''),
('径（徑）', 'Diameter', 'ケイ', '-', '', ''),
('型', 'Model', 'ケイ', 'かた', '', ''),
('景', 'Scenery', 'ケイ', '-', '', ''),
('芸（藝）', 'Art, Drama*', 'ゲイ', '-', '', ''),
('欠（缺）', 'Lack', 'ケツ', 'か', '', ''),
('結', 'Tie', 'ケツ', 'むす、ゆ', '', ''),
('建', 'Build', 'ケン（コン）', 'た', '', ''),
('健', 'Healthy', 'ケン', 'すこ', '', ''),
('験（驗）　（）', 'Test', 'ケン（ゲン）', '-', '', ''),
('固', 'Hard', 'コ', 'かた', '', ''),
('功', 'Achievement', 'コウ（ク）', '-', '', ''),
('好', 'Like', 'コウ', 'す、この', '', ''),
('候', 'Climate', 'コウ', 'そうろう', '', ''),
('航', 'Cruise', 'コウ', '-', '', ''),
('康', 'Health', 'コウ', '-', '', ''),
('告', 'Tell', 'コク', 'つ', '', ''),
('差', 'Distinctio', 'サ', 'さ', '', ''),
('菜', 'Vegetable', 'サイ', 'な', '', ''),
('最', 'Most', 'サイ', 'もっと', '', ''),
('材', 'Lumber*', 'ザイ', '-', '', ''),
('昨', 'Previous', 'サク', '-', '', ''),
('札', 'Tag', 'セツ', 'ふだ', '', ''),
('刷', 'Print*', 'サツ', 'す', '', ''),
('殺（殺）　（）', 'Kill', 'サツ', 'ころ、や', '', ''),
('察', 'Guess', 'サツ', '-', '', ''),
('参（參）', 'Participate', 'サン', 'まい', '', ''),
('産', 'Give birth', 'サン', 'う、うぶ', '', ''),
('散', 'Scatter', 'サン', 'ち', '', ''),
('残（殘）', 'Remainder', 'ザン', 'のこ', '', ''),
('士', 'Gentleman', 'シ', '-', '', ''),
('氏', 'Family name', 'シ', 'うじ', '', ''),
('史', 'History', 'シ', '-', '', ''),
('司', 'Director', 'シ', '-', '', ''),
('試', 'Test', 'シ', 'ため、こころみ', '', ''),
('児（兒）（儿）', 'Child', 'ジ（ニ）', '-', '', ''),
('治', 'Govern', 'ジ、チ', 'なお、おさ', '', ''),
('辞（辭）', 'Resign', 'ジ', 'や', '', ''),
('失', 'Lose', 'シツ', 'うしな', '', ''),
('借', 'Borrow', 'シャク', 'か', '', ''),
('種', 'Kind', 'シュ', 'たね', '', ''),
('周', 'Circumference', 'シュウ', 'まわ', '', ''),
('祝（祝）', 'Celebrate', 'シュク（シュウ）', 'いわ', '', ''),
('順', 'Obey', 'ジュン', '-', '', ''),
('初', 'First', 'ショ', 'はじ、はつ、うい、そ', '', ''),
('松', 'Pine', 'ショウ', 'まつ', '', ''),
('笑', 'Laugh', 'ショウ', 'わら、え', '', ''),
('唱', 'Chant', 'ショウ', 'とな', '', ''),
('焼（燒）', 'Bake', 'ショウ', 'や', '', ''),
('象', 'Elephant', 'ゾウ、ショウ', '-', '', ''),
('照', 'Illuminate*', 'ショウ', 'て', '', ''),
('賞', 'Prize', 'ショウ', '-', '', ''),
('臣', 'Retainer*', 'シン、ジン', '-', '', ''),
('信', 'Trust', 'シン', '-', '', ''),
('成', 'Become', 'セイ', 'な', '', ''),
('省', 'Government ministry*', 'セイ、ショウ', 'かえり、はぶ', '', ''),
('清', 'Pure', 'セイ', 'きよ', '', ''),
('静（靜）', 'Quiet', 'セイ', 'しず', '', ''),
('席', 'Seat', 'セキ', '-', '', ''),
('積', 'Accumulate', 'セキ', 'つ', '', ''),
('折', 'Fold', 'セツ', 'お、おり', '', ''),
('節（節）', 'Node*', 'セツ', 'ふし', '', ''),
('説（）', 'Theory*', 'セツ（ゼイ）', 'と', '', ''),
('浅（淺）', 'Shallow', 'セン', 'あさ', '', ''),
('戦（戰）', 'War', 'セン', 'たたか、いくさ', '', ''),
('選', 'Choose', 'セン', 'えら', '', ''),
('然', 'So*', 'ゼン、ネン', '-', '', ''),
('争（爭）', 'Conflict*', 'ソウ', 'あらそ', '', ''),
('倉', 'Warehouse', 'ソウ', 'くら', '', ''),
('巣（巢）', 'Nest', 'ソウ', 'す', '', ''),
('束', 'Bundle', 'ソク', 'たば', '', ''),
('側', 'Side', 'ソク', 'がわ', '', ''),
('続（續）', 'Continue', 'ゾク', 'つづ', '', ''),
('卒', 'Graduate', 'ソツ', '-', '', ''),
('孫', 'Grandchild', 'ソン', 'まご', '', ''),
('帯（帶）', 'Sash', 'タイ', 'お、おび', '', ''),
('隊', 'Group', 'タイ', '-', '', ''),
('達', 'Attain', 'タツ', '-', '', ''),
('単（單）', 'Simple', 'タン', '-', '', ''),
('置', 'Put', 'チ', 'お', '', ''),
('仲', 'Relationship*', 'チュウ', 'なか', '', ''),
('貯', 'Savings*', 'チョ', '-', '', ''),
('兆', 'Portent, Trillion*', 'チョウ', 'きざ', '', ''),
('腸', 'Intestines', 'チョウ', '-', '', ''),
('低', 'Low', 'テイ', 'ひく', '', ''),
('底', 'Bottom', 'テイ', 'そこ', '', ''),
('停', 'Halt*', 'テイ', '', '', ''),
('的', 'Target', 'テキ', 'まと', '', ''),
('典', 'Code', 'デン', '', '', ''),
('伝（傳）', 'Transmit', 'デン', 'つた', '', ''),
('徒', 'Junior*', 'ト', '-', '', ''),
('努', 'Toil*', 'ド', 'つと', '', ''),
('灯（燈）', 'Lamp', 'トウ', 'ひ', '', ''),
('堂', 'Public chamber*', 'ドウ', '-', '', ''),
('働', 'Work', 'ドウ', 'はたら', '', ''),
('特', 'Special', 'トク', '-', '', ''),
('得', 'Acquire', 'トク', 'え、う', '', ''),
('毒', 'Poison', 'ドク', '-', '', ''),
('熱', 'Heat', 'ネツ', 'あつ', '', ''),
('念', 'Thought*', 'ネン', '-', '', ''),
('敗', 'Failure', 'ハイ', 'やぶ', '', ''),
('梅（梅）', 'Japanese apricot*, Plum', 'バイ', 'うめ', '', ''),
('博', 'Dr. *phD', 'ハク（バク）', '-', '', ''),
('飯', 'Meal', 'ハン', 'めし', '', ''),
('飛（）', 'Fly', 'ヒ', 'と', '', ''),
('費（）', 'Expense', 'ヒ', 'つい', '', ''),
('必', 'Without fail', 'ヒツ', 'かなら', '', ''),
('票', 'Ballot', 'ヒョウ', '-', '', ''),
('標', 'Signpost', 'ヒョウ', '-', '', ''),
('不', 'Non-', 'フ、ブ', '-', '', ''),
('夫', 'Husband', 'フ（フウ）', 'おっと', '', ''),
('付', 'Attach', 'フ', 'つ', '', ''),
('府', 'Urban prefecture', 'フ', '-', '', ''),
('副', 'Vice', 'フク', '-', '', ''),
('粉', 'Flour', 'フン', 'こ、こな', '', ''),
('兵', 'Soldier', 'ヘイ、ヒョウ', '-', '', ''),
('別', 'Separate', 'ベツ', 'わか', '', ''),
('辺（邊）', 'Environs*', 'ヘン', 'あた、べ', '', ''),
('変（變）', 'Change', 'ヘン', 'か', '', ''),
('便', 'Convenience', 'ベン、ビン', 'たよ', '', ''),
('包', 'Wrap', 'ホウ', 'つつ', '', ''),
('法', 'Method', 'ホウ', '-', '', ''),
('望', 'Hope', 'ボウ、モウ', 'のぞ', '', ''),
('牧', 'Breed*', 'ボク', 'まき', '', ''),
('末', 'End', 'マツ、バツ', 'すえ', '', ''),
('満（滿）', 'Full', 'マン', 'み', '', ''),
('未', 'Not yet', 'ミ', '-', '', ''),
('脈', 'Vein', 'ミャク', '-', '', ''),
('民', 'People', 'ミン', 'たに', '', ''),
('無（）', 'Nothing', 'ム、ブ', 'な', '', ''),
('約', 'Promise', 'ヤク', '-', '', ''),
('勇', 'Courage', 'ユウ', 'いさ', '', ''),
('要', 'Need', 'ヨウ', 'い、かなめ', '', ''),
('養', 'Foster', 'ヨウ', 'やしな', '', ''),
('浴', 'Bathe', 'ヨク', 'あ', '', ''),
('利', 'Profit', 'リ', 'き', '', ''),
('陸', 'Land', 'リク', '-', '', ''),
('良', 'Good', 'リョウ', 'よ', '', ''),
('料', 'Fee', 'リョウ', '-', '', ''),
('量', 'Quantity', 'リョウ', 'はか', '', ''),
('輪', 'Wheel', 'リン', 'わ', '', ''),
('類（類）', 'Sort', 'ルイ', 'たぐ', '', ''),
('令', 'Orders*', 'レイ', '-', '', ''),
('冷', 'Cool', 'レイ', 'つめ、さ、ひ', '', ''),
('例', 'Example', 'レイ', 'たと', '', ''),
('歴（歷）', 'Curriculum*', 'レキ', '-', '', ''),
('連', 'Take along', 'レン', 'つ、つら', '', ''),
('老', 'Old man', 'ロウ', 'お、ふ', '', ''),
('労　（勞）', 'Labor', 'ロウ', '-', '', ''),
('録　（錄）', 'Record', 'ロク', '-', '', ''),

/* Grade 5 */

/*
('圧', 'Pressure', 'アツ', '', '', ''),
('移', 'Move', 'ウツ', '', '', ''),
('因', 'Cause', 'イン', '', '', ''),
('永', 'Eternity', 'エイ', '', '', ''),
('営', 'Manage', 'エイ', '', '', ''),
('街', 'Defense', 'ガイ', '', '', ''),
('易', 'Easy', 'エキ', '', '', ''),
('益', 'Benefit', 'エキ', '', '', ''),
('液', 'Fluid', 'エキ', '', '', ''),
('演', 'Perform', 'エン', '', '', ''),
('応', 'Respond', 'オウ', '', '', ''),
('往', 'Outward journey', 'オウ', '', '', ''),
('桜', 'Cherry tree*', 'オウ', 'さくら', '', ''),
('恩', 'Grace', 'エン', '', '', ''),
('可', 'Possible', 'カ', 'かわ', '', ''),
('仮', 'Temporary', '', '', '', ''),
('価', 'Value', 'カ', '', '', ''),
('河', 'River', '', '', '', ''),
('過', 'Go beyond', '', '', '', ''),
('賀', 'Congratulations', 'ガ', '', '', ''),
('快', 'Cheerful', 'カイ', 'こころよ', '', ''),
('解', 'Untie', 'カイ', 'わか', '', ''),
('格', 'Status', 'カク', '', '', ''),
('確', 'Certain', 'カク', 'たし', '', ''),
('額', 'Amount', 'ガク', 'ひたい', '', ''),
('刊', 'Publish', 'カン', '', '', ''),
('幹', 'Tree trunk', 'カン', '', '', ''),
('慣', 'Accustomed**', 'カン', '', '', ''),
('眼', 'Eyeball*', 'ガン', '', '', ''),
('基', 'Foundation', 'キ', '', '', ''),
('寄', 'Approach*', 'キ', '', '', ''),
('規', 'Rule', 'キ', '', '', ''),
('技', 'Skill', 'ギ', '', '', ''),
('義', '', 'ギ', '', '', ''),
('逆', '', 'ギャク', 'さか', '', ''),
('久', '', 'キュウ', '', '', ''),
('旧', '', 'キュウ', '', '', ''),
('居', '', 'キョ', '', '', ''),
('許', '', 'キョ', 'ゆる', '', ''),
('境', '', 'キョウ', '', '', ''),
('均', '', 'キン', '', '', ''),
('禁', '', 'キン', '', '', ''),
('句', '', 'ク', '', '', ''),
('群', '', 'グン', '', '', ''),
('経', '', 'ケイ', '', '', ''),
('潔', '', 'ケツ', '', '', ''),
('件', '', 'ケン', '', '', ''),
('券', '', 'ケン', '', '', ''),
('険', '', 'ケン', '', '', ''),
('検', '', 'ケン', '', '', ''),
('限', '', 'ゲン', '', '', ''),
('現', '', 'ゲン', '', '', ''),
('減', '', 'ゲン', '', '', ''),
('故', '', 'コ', '', '', ''),
('個', '', 'コ', '', '', ''),
('護', '', 'ゴ', '', '', ''),
('効', '', 'コウ', '', '', ''),
('厚', '', 'コ', '', '', ''),
('耕', '', '', '', '', ''),
('鉱', '', 'コウ', '', '', ''),
('構', '', 'コウ', '', '', ''),
('興', '', 'コウ', '', '', ''),
('講', '', 'コウ', '', '', ''),
('混', '', 'コン', '', '', ''),
('査', '', 'サ', '', '', ''),
('再', '', 'サイ', 'ふたた', '', ''),
('災', '', 'サイ', '', '', ''),
('妻', '', 'サイ', '', '', ''),
('採', '', 'サイ', '', '', ''),
('際', '', 'サイ', '', '', ''),
('在', '', 'ザイ', '', '', ''),
('財', '', '', '', '', ''),
('罪', '', 'ザイ', '', '', ''),
('雑', '', 'ザツ', '', '', ''),
('酸', '', 'サン', '', '', ''),
('賛', '', 'サン', '', '', ''),
('支', '', 'シ', 'ささ', '', ''),
('志', '', 'シ', '', '', ''),
('枝', '', 'ギ', '', '', ''),
('師', '', 'シ', '', '', ''),
('資', '', 'シ', '', '', ''),
('飼', '', 'シ', '', '', ''),
('示', '', 'シ', '', '', ''),
('似', '', '', '', '', ''),
('識', '', 'シ', '', '', ''),
('質', '', 'シツ', '', '', ''),
('舎', '', 'シャ', '', '', ''),
('謝', '', 'シャ', '', '', ''),
('授', '', 'ジュ', '', '', ''),
('修', '', 'シュウ', '', '', ''),
('述', '', 'ジュツ', '', '', ''),
('術', '', 'ジュツ', '', '', ''),
('準', '', 'ジュン', '', '', ''),
('序', '', '', '', '', ''),
('招', '', 'ショウ', '', '', ''),
('承', '', 'ショウ', '', '', ''),
('証', '', 'ショウ', '', '', ''),
('条', '', 'ジョウ', '', '', ''),
('状', '', 'ジョウ', '', '', ''),
('常', '', 'ジョウ', '', '', ''),
('情', '', 'ジョウ', 'なさ', '', ''),
('織', '', '', '', '', ''),
('職', '', '', '', '', ''),
('制', '', 'セイ', '', '', ''),
('性', '', 'セイ', '', '', ''),
('政', '', 'セイ', '', '', ''),
('勢', '', '', '', '', ''),
('精', '', 'セイ', '', '', ''),
('製', '', 'セイ', '', '', ''),
('税', '', 'ゼイ', '', '', ''),
('責', '', 'セキ', '', '', ''),
('績', '', 'セキ', '', '', ''),
('接', '', 'セツ', '', '', ''),
('設（）', '', 'セツ', '', '', ''),
('舌', '', '', '', '', ''),
('絶', '', 'ゼツ', '', '', ''),
('銭', '', '', '', '', ''),
('祖', '', 'ソ', '', '', ''),
('素', '', 'ソ', '', '', ''),
('総', '', 'ソウ', '', '', ''),
('造', '', 'ゾウ', '', '', ''),
('像', '', 'ゾウ', '', '', ''),
('増', '', '', '', '', ''),
('則', '', 'ソク', '', '', ''),
('測', '', 'ソク', '', '', ''),
('属', '', 'ゾク', '', '', ''),
('率', '', 'リツ', '', '', ''),
('損', '', 'ソン', '', '', ''),
('退', '', 'タイ', '', '', ''),
('貸', '', 'カ', '', '', ''),
('態', '', 'タイ', '', '', ''),
('団', '', 'ダン', '', '', ''),
('断', '', 'ダン', '', '', ''),
('築', '', 'チク', '', '', ''),
('張', '', 'チョウ', '', '', ''),
('提', '', 'テイ', '', '', ''),
('程', '', 'テイ', 'ほど', '', ''),
('適', '', 'テキ', '', '', ''),
('敵', '', 'テキ', '', '', ''),
('統', '', 'ジュウ', '', '', ''),
('銅', '', 'ドウ', '', '', ''),
('導', '', 'ドウ', 'みちび', '', ''),
('徳', '', 'トク', '', '', ''),
('独（）', '', 'ドク', '', '', ''),
('任', '', 'ニン', '', '', ''),
('燃', '', '', '', '', ''),
('能', '', 'ノウ', '', '', ''),
('破', '', '', '', '', ''),
('犯', '', 'ハン', '', '', ''),
('判', '', 'パン', '', '', ''),
('版', '', 'バン', '', '', ''),
('比', '', 'ヒ', '', '', ''),
('肥', '', 'ヒ', '', '', ''),
('非', '', 'ヒ', '', '', ''),
('備', '', 'ビ', '', '', ''),
('俵', '', 'ヒョウ', '', '', ''),
('評', '', 'ヒョウ', '', '', ''),
('貧', '', 'ショウ', '', '', ''),
('布', '', 'ブ', '', '', ''),
('婦', '', 'フ', '', '', ''),
('富', '', 'フ', '', '', ''),
('武', '', 'シ', '', '', ''),
('復', '', 'フク', '', '', ''),
('複', '', 'フク', '', '', ''),
('仏（）', '', 'ブツ', '', '', ''),
('編', '', 'ヘン', '', '', ''),
('弁', '', 'ベン', '', '', ''),
('保', '', 'ホ', '', '', ''),
('墓', '', 'キ', '', '', ''),
('報', '', 'ホウ', '', '', ''),
('豊', '', 'ホウ', '', '', ''),
('防', '', 'ボウ', '', '', ''),
('貿', '', 'ボウ', '', '', ''),
('暴', '', 'ボウ', '', '', ''),
('務', '', 'ム', '', '', ''),
('夢', '', 'ム', '', '', ''),
('迷', '', '', 'まよ', '', ''),
('綿', '', 'セン', '', '', ''),
('輸', '', 'リン', '', '', ''),
('余', '', 'ヨ', '', '', ''),
('預', '', 'ヨ', '', '', ''),
('容', '', 'ヨウ', '', '', ''),
('略', '', 'リャク', '', '', ''),
('留', '', 'リュウ', '', '', ''),
('領', '', 'リョウ', '', '', ''),


/* Grade 6 */

/*
('異', '', 'イ', 'こと', '', ''),
('遺', '', '', '', '', ''),
('域', '', '', '', '', ''),
('宇', '', 'ウ', '', '', ''),
('映', '', 'エイ', '', '', ''),
('延', '', 'エン', '', '', ''),
('沿', '', 'エン', 'そ', '', ''),
('我', '', 'ガ', '', '', ''),
('灰', '', 'ハイ', '', '', ''),
('拡', '', 'カク', '', '', ''),
('革', '', 'カク', '', '', ''),
('閣', '', 'カク', '', '', ''),
('割', '', 'ゲ', 'わ', '', ''),
('株', '', '', 'かぶ', '', ''),
('干', '', 'ガン', '', '', ''),
('巻', '', 'ケン', 'ま', '', ''),
('看', '', 'カン', 'み', '', ''),
('簡', '', 'カン', '', '', ''),
('危', '', 'キ', 'あぶ、あや', '', ''),
('机', '', 'キ', 'つくえ', '', ''),
('揮', '', 'キ', '', '', ''),
('貴', '', 'キ', '', '', ''),
('疑', '', 'ギ', 'うたが', '', ''),
('吸', '', 'キュウ', '', '', ''),
('供', '', 'キョウ', '', '', ''),
('胸', '', 'キョウ', 'むね', '', ''),
('郷', '', 'キョウ', 'さと', '', ''),
('勤', '', 'キン', 'つと', '', ''),
('筋', '', 'キン', 'すじ', '', ''),
('系', '', 'ケイ', '', '', ''),
('敬', '', 'ケイ', '', '', ''),
('警', '', 'ケイ', '', '', ''),
('劇', '', 'ゲキ', '', '', ''),
('激', '', 'ゲキ', '', '', ''),
('穴', '', '', 'あな', '', ''),
('絹', '', 'ソン', '', '', ''),
('権', '', 'ケン', '', '', ''),
('憲', '', 'ケン', '', '', ''),
('源', '', 'ゲン', 'みなもと', '', ''),
('厳', '', 'ゲン', 'きび', '', ''),
('己', '', 'ジ', 'おの', '', ''),
('呼', '', '', 'よ', '', ''),
('誤', '', 'ゴ', '', '', ''),
('后', '', '', '', '', ''),
('孝', '', 'コウ', '', '', ''),
('皇', '', 'コウ', '', '', ''),
('紅', '', 'コウ', 'あか、べに', '', ''),
('降', '', '', '', '', ''),
('鋼', '', '', 'はがね', '', ''),
('刻', '', 'ケ', '', '', ''),
('穀', '', 'サツ', '', '', ''),
('骨', '', 'セツ', 'ほね', '', ''),
('困', '', 'コン', '', '', ''),
('砂', '', '', '', '', ''),
('座', '', 'ザ', 'すわ', '', ''),
('済', '', 'ザイ', 'す', '', ''),
('裁', '', 'サイ', '', '', ''),
('策', '', 'サク', '', '', ''),
('冊', '', 'サツ', '', '', ''),
('蚕', '', 'ヒョウ', '', '', ''),
('至', '', 'チ', '', '', ''),
('私', '', 'シ', '', '', ''),
('姿', '', '', 'すがた', '', ''),
('視', '', 'シ', 'み', '', ''),
('詞', '', 'シ', '', '', ''),
('誌', '', 'シ', '', '', ''),
('磁', '', '', '', '', ''),
('射', '', 'シャ', '', '', ''),
('捨', '', 'シャ', '', '', ''),
('尺', '', 'シャク', '', '', ''),
('若', '', 'ジャク', '', '', ''),
('樹', '', '', '', '', ''),
('収', '', 'シュウ', '', '', ''),
('宗', '', 'シュウ', '', '', ''),
('就', '', 'シュウ', '', '', ''),
('衆', '', 'シュウ', '', '', ''),
('縦', '', 'ジュウ', '', '', ''),
('従', '', 'ジュウ', 'したが', '', ''),
('縮', '', '', '', '', ''),
('熟', '', '', '', '', ''),
('純', '', 'ジュン', '', '', ''),
('処', '', 'ショ', '', '', ''),
('署', '', 'ショ', '', '', ''),
('諸', '', 'ショ', '', '', ''),
('除', '', 'チョ', '', '', ''),
('将', '', 'ショウ', '', '', ''),
('傷', '', 'ショウ', '', '', ''),
('障', '', 'ショウ', '', '', ''),
('城', '', 'ジョウ', '', '', ''),
('蒸', '', 'ジョウ', '', '', ''),
('針', '', '', '', '', ''),
('仁', '', '', '', '', ''),
('垂', '', '', '', '', ''),
('推', '', 'スイ', '', '', ''),
('寸', '', '', '', '', ''),
('盛', '', 'セイ', 'も', '', ''),
('聖', '', 'セイ', '', '', ''),
('誠', '', 'セイ', '', '', ''),
('宣', '', 'セン', '', '', ''),
('専', '', 'セン', '', '', ''),
('泉', '', 'セン', 'いずみ', '', ''),
('洗', '', 'セン', '', '', ''),
('染', '', 'セン', '', '', ''),
('善', '', 'ゼン', '', '', ''),
('奏', '', '', '', '', ''),
('窓', '', 'ソウ', 'まど', '', ''),
('創', '', 'ソウ', 'くら', '', ''),
('装', '', 'ソウ', '', '', ''),
('層', '', 'ゾウ', '', '', ''),
('操', '', '', '', '', ''),
('蔵', '', '', '', '', ''),
('臓', '', 'ゾウ', '', '', ''),
('存', '', 'ゾン', '', '', ''),
('尊', '', '', '', '', ''),
('宅', '', 'タク', '', '', ''),
('担', '', 'タン', '', '', ''),
('探', '', 'タン', '', '', ''),
('誕', '', 'タン', '', '', ''),
('段', '', 'ダン', '', '', ''),
('暖', '', '', 'あたた', '', ''),
('値', '', '', '', '', ''),
('宙', '', 'チュウ', '', '', ''),
('忠', '', 'チュウ', '', '', ''),
('著', '', 'チョ', '', '', ''),
('庁', '', '', '', '', ''),
('頂', '', '', '', '', ''),
('潮', '', 'コ', '', '', ''),
('賃', '', 'カ', '', '', ''),
('痛', '', 'ツウ', '', '', ''),
('展', '', 'テン', '', '', ''),
('討', '', 'トウ', '', '', ''),
('党', '', 'ドウ', '', '', ''),
('糖', '', 'トウ', '', '', ''),
('届', '', '', '', '', ''),
('難', '', 'ナン', '', '', ''),
('乳', '', 'ニュウ', '', '', ''),
('認', '', 'ニン', 'みと', '', ''),
('納', '', '', '', '', ''),
('脳', '', 'ノウ', '', '', ''),
('派', '', 'ハ', '', '', ''),
('拝', '', 'ハイ', '', '', ''),
('背', '', 'セ', '', '', ''),
('肺', '', 'ハイ', '', '', ''),
('俳', '', 'ハイ', '', '', ''),
('班', '', 'バン', '', '', ''),
('晩', '', '', '', '', ''),
('否', '', '', '', '', ''),
('批', '', 'ヒ', '', '', ''),
('秘', '', 'ヒ', '', '', ''),
('腹', '', '', '', '', ''),
('奮', '', '', '', '', ''),
('並', '', '', 'なら', '', ''),
('陛', '', '', '', '', ''),
('閉', '', '', 'し', '', ''),
('片', '', '', '', '', ''),
('補', '', '', '', '', ''),
('暮', '', '', '', '', ''),
('宝', '', 'ホウ', '', '', ''),
('訪', '', 'ホウ', 'たず', '', ''),
('亡', '', 'ボウ', '', '', ''),
('忘', '', 'ボウ', 'わす', '', ''),
('棒', '', 'ボウ', '', '', ''),
('枚', '', '', '', '', ''),
('幕', '', 'ボ', '', '', ''),
('密', '', 'ミツ', '', '', ''),
('盟', '', 'メイ', '', '', ''),
('模', '', '', '', '', ''),
('訳', '', 'ヤク', '', '', ''),
('郵', '', '', '', '', ''),
('優', '', 'ユウ', '', '', ''),
('幼', '', 'ヨウ', '', '', ''),
('欲', '', 'ヨク', '', '', ''),
('翌', '', 'ヨク', '', '', ''),
('乱', '', 'ラン', '', '', ''),
('卵', '', 'ラン', 'たまご', '', ''),
('覧', '', 'ラン', '', '', ''),
('裏', '', '', '', '', ''),
('律', '', 'リツ', '', '', ''),
('臨', '', 'リン', '', '', ''),
('朗', '', 'リン', '', '', ''),
('論', '', 'ロン', '', '', '');
*/


/* Grades 7 to 12 then Jinmeiyou Kanji 

('', '', '', '', '', '');
('', '', '', '', '', '');
('', '', '', '', '', '');
('', '', '', '', '', '');
('', '', '', '', '', '');
('', '', '', '', '', '');
('', '', '', '', '', '');
('', '', '', '', '', '');
('', '', '', '', '', '');
('', '', '', '', '', '');
('', '', '', '', '', '');
('', '', '', '', '', '');

	亜	亞	
2	哀
3	挨	
5	曖		
7	握		
9	扱	
10	宛		
11	嵐	
20	依	
22	威	
23	為	爲
24	畏		
26	尉		
29	萎	
30	偉	
31	椅	
32	彙	
34	違	
35	維	
36	慰		
38	緯	
42	壱	壹
43	逸	逸 [4]	
44	茨 [5]	
45	芋	
49	咽	
50	姻	
53	淫 [7]	
54	陰	
56	隠	隱	
57	韻	
62	唄	
63	鬱		
64	畝		
65	浦		
74	詠		
75	影		
76	鋭		
79	疫	
83	悦	
84	越	
85	謁	謁 [4]
86	閲	
90	炎	
91	怨	
92	宴	
93	媛	
94	援	
96	煙	
97	猿	
99	鉛	
102	縁	緣
103	艶	艷
104	汚	
106	凹	
110	押	
111	旺	
112	欧	歐
113	殴	毆	
115	翁	
116	奥	奧
118	岡		
121	憶		
122	臆		
123	虞		
124	乙	
125	俺		
126	卸		
130	穏	穩



139	佳		
143	苛		
145	架		
149	華		
150	菓	
152	渦	
154	嫁	
155	暇	
156	禍	禍 
157	靴	
158	寡	
160	箇	
161	稼	
163	蚊	
164	牙 [5]	
165	瓦	
170	雅	
171	餓	
172	介	
177	戒	
179	怪		
180	拐		
181	悔	悔 [4]
184	皆		
189	塊		
190	楷		
192	潰		
193	壊	壞	
194	懐	懷	
195	諧	
198	劾		
200	崖		
201	涯		
203	慨	慨 [4]
204	蓋		
205	該		
206	概	槪
207	骸	
208	垣	
209	柿	
215	核	
216	殻	殼
217	郭	
219	較	
220	隔		
223	獲	
224	嚇	
225	穫	
227	岳	嶽
230	顎	
231	掛		
232	潟		
233	括		
235	喝	喝 [4]
236	渇	渴
238	葛 [7]		
239	滑		
240	褐	褐 [4]
241	轄		
242	且		
244	釜		
245	鎌		
246	刈		
249	甘		
250	汗		
251	缶	罐	
253	肝		
255	冠		
258	陥	陷	
259	乾		
260	勘		
261	患		
262	貫		
264	喚		
265	堪		
266	換		
267	敢	
268	棺	
269	款		
271	閑	
272	勧	勸
273	寛	寬
280	歓	歡	
281	監		
282	緩		
283	憾		
284	還		
286	環		
289	韓 [5]		
290	艦		
291	鑑		
293	含		
296	玩		
298	頑		
301	企		
302	伎		
306	岐		
308	忌		
310	奇		
311	祈	祈 [4]
314	軌		
315	既	既 [4]
318	飢		
319	鬼		
324	亀	龜
326	幾		
329	棋		
331	棄	
332	毀	
335	畿	
336	輝	
338	騎	
340	宜	
341	偽	僞
342	欺	
345	儀	
346	戯	戲
347	擬	
348	犠	犧	
350	菊	
351	吉	
352	喫	
353	詰	
354	却		
356	脚		
358	虐		
361	及		
363	丘		
367	朽		
368	臼		
374	糾		
379	嗅		
380	窮		
383	巨		
385	拒		
386	拠	據	
388	虚	虛	
390	距		
392	御		
394	凶		
396	叫		
397	狂		
399	享		
402	況		
403	峡	峽	
404	挟	挾	
405	狭	狹	
406	恐		
407	恭	
409	脅		
415	矯		
418	響	響 [4]
419	驚		
420	仰		
421	暁	曉	
423	凝		
428	巾		
429	斤		
433	菌		
435	琴	
437	僅 [7]		
439	緊		
440	錦		
441	謹	謹 [4]
442	襟	
443	吟	
448	駆	驅	
450	惧	
451	愚	
453	偶	
454	遇	
455	隅	
456	串	
457	屈	
458	掘	
459	窟	
460	熊	
461	繰	
464	勲	勳
465	薫	薰
470	刑	
474	茎	莖
477	契	
479	恵	惠
480	啓	
481	掲	揭
482	渓	溪
484	蛍	螢
488	傾		
489	携		
490	継	繼	
491	詣	
492	慶	
493	憬	
494	稽	
495	憩	
497	鶏	鷄
499	迎	
500	鯨	
501	隙	
503	撃	擊
505	桁	
511	傑	
518	肩	
522	倹	儉
523	兼		
524	剣	劍
525	拳	
526	軒	
529	圏	圈	
530	堅		
532	嫌		
533	献	獻
535	遣		
538	賢	
539	謙	
540	鍵	
541	繭	
542	顕	顯
544	懸		
546	幻	
547	玄		
549	弦	
553	舷	
562	股		
563	虎		
564	孤		
565	弧		
567	枯		
571	雇		
572	誇		
573	鼓		
574	錮		
575	顧		
577	互		
579	呉		
581	娯		
582	悟		
583	碁		
590	勾		
591	孔		
593	巧		
595	甲		
601	江		
604	坑		
606	抗		
607	攻		
608	更		
611	拘		
612	肯		
613	侯		
615	恒	恆	
616	洪		
619	荒		
620	郊		
621	香		
626	貢		
630	控		
631	梗		
633	喉		
634	慌		
636	硬		
637	絞		
638	項		
639	溝		
642	綱		
643	酵		
644	稿		
646	衡		
649	購		
650	乞		
653	拷	
654	剛	
655	傲		
656	豪		
657	克		
664	酷		
665	獄		
667	駒		
668	込	
669	頃		
672	昆		
673	恨		
675	婚		
677	痕		
678	紺		
679	魂		
680	墾	
681	懇	
683	佐	
684	沙	
687	唆	
689	詐	
690	鎖	
692	挫	
697	采	
698	砕	碎	
699	宰		
700	栽		
701	彩	
705	斎	齋
710	債	
711	催		
712	塞		
713	歳	
714	載	
716	埼	
719	剤	劑
722	崎	
724	削	
726	柵	
727	索	
729	酢	
730	搾	
731	錯	
732	咲	
736	刹	
737	拶	
740	撮	
741	擦		
747	桟	棧
749	惨	慘
751	傘	
757	斬	
758	暫	
770	旨	
774	伺	
778	刺	
782	祉	祉 [4]
783	肢		
787	施		
789	恣		
791	脂	
793	紫	
796	嗣	
802	雌	
803	摯	
804	賜	
805	諮	
815	侍	
819	滋	
820	慈	
823	餌 [8]	
824	璽	
825	鹿	
828	軸	
830	𠮟 [5]	
833	疾	
834	執	
835	湿	濕	
836	嫉	
837	漆	
840	芝	
848	赦	
849	斜	
850	煮	煮 [4]
851	遮	
853	邪	
854	蛇	
857	酌	
858	釈	釋
859	爵		
862	寂		
866	朱	
868	狩	
870	殊	
871	珠	
873	腫		
875	趣	
876	寿	壽
878	呪	
880	需	
881	儒	
884	囚	
886	舟	
887	秀	
892	臭	臭 [4]
894	袖	
896	羞	
902	愁	
903	酬	
904	醜	
905	蹴	
906	襲	
908	汁	
909	充	
911	柔		
914	渋	澁	
915	銃	
916	獣	獸
918	叔		
921	淑	
922	粛	肅
924	塾	
929	俊	
931	瞬	
932	旬	
933	巡	
934	盾	
935	准	
936	殉	
938	循	
941	潤		
942	遵	
947	庶	
950	緒	緖
953	如	
956	叙	敍
957	徐	
960	升	
962	召	
963	匠	
964	床	
965	抄	
966	肖	
967	尚	
970	昇	
972	沼	
974	宵	
977	症	
978	祥	祥 [4]
979	称	稱
983	渉	涉
985	紹	
986	訟	
988	掌	
989	晶	
991	焦		
992	硝		
993	粧		
994	詔		
998	奨	奬	
1000	詳		
1001	彰		
1003	憧		
1004	衝		
1006	償		
1007	礁		
1008	鐘	
1010	丈	
1011	冗	
1016	浄	淨	
1017	剰	剩
1021	畳	疊
1023	縄	繩	
1024	壌	壤	
1025	嬢	孃	
1026	錠	
1027	譲	讓
1028	醸	釀
1030	拭		
1033	殖		
1034	飾	
1035	触	觸	
1036	嘱	囑	
1039	辱		
1040	尻		
1043	伸		
1045	芯	
1047	辛	
1048	侵	
1050	津	
1052	唇		
1053	娠		
1054	振		
1055	浸		
1059	紳		
1062	診		
1063	寝	
1064	慎	
1066	審	
1067	震		
1068	薪	
1071	刃		
1073	尽	盡	
1074	迅		
1075	甚		
1076	陣		
1077	尋		
1078	腎		
1079	須	
1082	吹	
1084	炊	
1085	帥	
1086	粋	粹
1087	衰		
1089	酔	醉
1090	遂	
1091	睡	
1092	穂	穗
1093	随	隨
1094	髄	髓
1095	枢	樞	
1096	崇		
1098	据	
1099	杉	
1100	裾	
1102	瀬	瀨
1103	是		
1104	井		
1112	姓		
1113	征		
1116	斉	齊	
1119	牲		
1121	凄		
1122	逝		
1125	婿		
1132	誓	
1134	請		
1136	醒		
1139	斥		
1143	析		
1145	脊		
1146	隻		
1147	惜		
1148	戚		
1150	跡		
1153	籍		
1156	拙		
1157	窃	竊	
1161	摂	攝	
1168	仙		
1169	占		
1177	扇		
1178	栓		
1179	旋		
1182	煎 [7]		
1183	羨		
1184	腺		
1185	詮 [7]		
1186	践	踐	
1187	箋		
1189	潜	潛	
1191	遷		
1193	薦		
1194	繊	纖	
1195	鮮		
1200	禅	禪
1201	漸		
1202	膳	
1203	繕	
1204	狙	
1205	阻	
1207	租	
1209	措	
1210	粗	
1212	疎	
1213	訴	
1214	塑	
1215	遡 [8]	
1216	礎	
1217	双	雙
1218	壮	壯
1224	荘	莊
1228	捜	搜	
1229	挿	插
1230	桑	
1232	掃	
1233	曹	
1234	曽	曾
1235	爽	
1238	喪	
1239	痩	瘦
1240	葬	
1242	僧	僧 
1246	遭	
1247	槽	
1248	踪	
1250	燥	
1251	霜	
1252	騒	騷
1253	藻	
1257	憎	憎 [4]	
1259	贈	贈 [4]	
1261	即	卽	
1264	促		
1267	捉	
1271	俗	
1274	賊	
1283	遜 [8]	


1286	汰		
1288	妥	
1289	唾	
1290	堕	墮
1291	惰	
1292	駄	
1296	耐	
1298	怠		
1299	胎		
1302	泰	
1303	堆	
1304	袋	
1305	逮	
1306	替	
1309	滞	滯
1311	戴	
1317	滝	瀧
1319	択	擇
1320	沢	澤
1321	卓	
1322	拓	
1323	託	
1324	濯	
1325	諾	
1326	濁		
1327	但	
1329	脱		
1330	奪	
1331	棚	
1332	誰	
1333	丹	
1334	旦	
1338	胆	膽
1340	淡	
1342	嘆	嘆 [4]	
1343	端		
1344	綻		
1346	鍛		
1351	弾	彈	
1354	壇		

1359	恥		
1360	致		
1361	遅	遲	
1362	痴	癡	
1363	稚		
1365	緻	
1367	畜	
1368	逐	
1369	蓄		
1371	秩		
1372	窒		
1375	嫡		
1379	沖	
1382	抽	
1386	衷	
1387	酎	
1388	鋳	鑄	
1389	駐		
1393	弔		
1398	挑	
1401	彫	
1402	眺	
1403	釣	
1407	貼	
1408	超	
1410	跳	
1411	徴	徵	
1412	嘲 [7]		
1414	澄		
1416	聴	聽	
1417	懲	懲 [4]	
1419	勅	敕
1420	捗 [7]	
1421	沈		
1422	珍	
1423	朕	
1424	陳	
1426	鎮	鎭	
1428	椎	
1429	墜	
1432	塚	塚 [4]
1433	漬	
1434	坪	
1435	爪		
1436	鶴	
1438	呈	
1439	廷	
1443	抵	
1444	邸	
1445	亭		
1446	貞		
1447	帝	
1448	訂	
1450	逓	遞	
1452	偵		
1453	堤		
1456	艇		
1457	締		
1458	諦		
1459	泥	
1462	摘	
1463	滴		
1466	溺 [7]	
1467	迭	
1468	哲	
1470	徹	
1471	撤	
1477	添	
1479	塡 [7]	
1482	殿	
1484	斗	
1485	吐	
1486	妬	
1488	途	
1490	渡		
1491	塗	
1492	賭 [7]	
1494	奴	
1497	怒	
1505	到	
1506	逃		
1507	倒		
1508	凍		
1509	唐		
1511	桃		
1513	透		
1515	悼		
1516	盗	盜
1517	陶	
1518	塔		
1519	搭		
1520	棟		
1522	痘		
1526	筒	
1528	稲	稻
1529	踏		
1532	謄	
1533	藤		
1534	闘	鬭
1535	騰	
1537	洞	
1538	胴	
1546	瞳	
1547	峠	
1548	匿	
1551	督	
1553	篤	
1557	栃 [5]	
1558	凸	
1559	突	突 
1561	屯	
1562	豚	
1563	頓	
1564	貪	
1565	鈍		
1566	曇	
1567	丼	
1568	那		
1569	奈		
1571	梨		
1572	謎 [8]		
1573	鍋		
1575	軟		
1578	尼		
1579	弐	貳	
1580	匂		
1582	虹		
1586	尿		
1588	妊		
1589	忍		
1591	寧		
1595	捻		
1596	粘		
1598	悩	惱	
1603	濃		
1604	把		
1608	覇	霸
1610	婆	
1611	罵	
1613	杯	
1618	排	
1620	廃	廢	
1621	輩	
1625	培	
1626	陪	
1627	媒	
1629	賠	
1631	伯	
1632	拍	
1633	泊		
1634	迫	
1635	剝 [7]		
1636	舶	
1638	薄		
1640	漠		
1641	縛	
1642	爆		
1644	箸 [7]	
1646	肌	
1648	鉢	
1650	髪	髮
1651	伐	
1652	抜	拔	
1653	罰		
1654	閥		
1657	氾	
1659	帆	
1660	汎	
1661	伴	
1664	阪	
1668	畔	
1669	般	
1670	販	
1671	斑	
1673	搬	
1674	煩		
1675	頒	
1676	範	
1677	繁	繁 [4]
1678	藩	
1681	蛮	蠻
1682	盤	
1685	妃	
1688	彼	
1689	披	
1692	卑	卑 [4]	
1694	疲		
1696	被		
1698	扉	
1700	碑	碑 [4]
1701	罷		
1702	避	
1703	尾	
1704	眉	
1707	微	
1709	膝	
1710	肘		
1711	匹		
1713	泌		
1715	姫		
1722	漂		
1724	苗		
1727	描		
1728	猫		
1730	浜	濱
1732	賓	賓 [4]	
1733	頻	頻 [4]
1734	敏	敏 [4]	
1735	瓶	甁	
1741	扶	
1743	怖	
1744	阜	
1745	附	
1746	訃	
1748	赴	
1749	浮		
1751	符		
1753	普	
1754	腐		
1755	敷	
1756	膚	
1757	賦	
1758	譜	
1759	侮	侮 [4]	
1762	舞	
1763	封	
1765	伏		
1768	幅	
1773	覆		
1774	払	拂
1775	沸		
1779	紛		
1780	雰		
1781	噴		
1782	墳		
1783	憤		
1788	丙		
1791	併	倂	
1793	柄		
1796	塀	塀 [4]
1797	幣		
1798	弊	
1799	蔽 [7]		
1800	餅 [8]	餠	
1802	壁	
1803	璧	
1804	癖		
1806	蔑		
1811	偏		
1812	遍		
1819	哺	
1820	捕		
1822	舗	
1824	募	
1826	慕	
1828	簿	
1831	芳	
1832	邦	
1833	奉		
1835	抱	
1838	泡	
1839	胞	
1840	俸	
1841	倣	
1842	峰	
1843	砲		
1844	崩		
1847	蜂	
1849	飽		
1850	褒	襃	
1851	縫	
1853	乏	
1854	忙	
1855	坊	
1856	妨	
1859	房	
1860	肪	
1861	某	
1862	冒	
1863	剖	
1864	紡	
1866	傍	
1867	帽	
1870	貌	
1872	膨		
1873	謀		
1874	頰 [7]	
1877	朴	
1879	睦	
1880	僕	
1881	墨	墨 
1882	撲	
1883	没	沒
1884	勃	
1885	堀	
1887	奔	
1888	翻	飜	
1889	凡	
1890	盆

1891	麻		
1892	摩	
1893	磨	
1894	魔		
1898	昧		
1899	埋		
1901	膜	
1902	枕		
1903	又	
1905	抹	
1908	慢	
1909	漫	
1912	魅	
1913	岬		
1915	蜜	
1917	妙	
1919	眠		
1920	矛		
1924	霧		
1925	娘		
1930	冥		
1932	銘		
1934	滅		
1935	免	免 [4]	
1938	麺	麵
1939	茂	
1942	妄	
1943	盲	
1944	耗	
1945	猛	
1946	網	
1948	黙	
1950	紋	


1952	冶		
1955	弥	彌	
1956	厄		
1961	躍		
1962	闇		
1965	喩		
1966	愉	
1967	諭	
1969	癒		
1970	唯	
1974	幽	
1975	悠	
1977	湧	
1978	猶	
1979	裕	
1981	雄	
1982	誘	
1983	憂		
1984	融	
1986	与	與
1989	誉	譽
1994	妖	
1998	庸	
1999	揚	
2000	揺	搖	
2003	溶		
2004	腰		
2006	瘍		
2007	踊		
2008	窯		
2010	擁		
2011	謡	謠	
2013	抑		
2014	沃	
2018	翼	
2019	拉		
2020	裸		
2021	羅		
2023	雷		
2024	頼	賴	
2025	絡		
2027	酪	
2028	辣	
2032	濫		
2033	藍		
2034	欄	欄 [4]
2035	吏		
2039	痢		
2041	履		
2042	璃		
2043	離		
2047	慄	
2049	柳	
2052	竜	龍
2053	粒		
2054	隆	隆 [4]
2055	硫	
2056	侶	
2058	虜	虜 [4]
2059	慮	
2060	了	
2064	涼	
2065	猟	獵
2066	陵	
2068	僚	
2070	寮	
2071	療	
2072	瞭	
2073	糧	
2077	厘	
2078	倫	
2080	隣	
2082	瑠	
2083	涙	淚
2084	累	
2085	塁	壘
2090	励	勵	
2091	戻	戾	
2093	鈴	
2094	零		
2095	霊	靈	
2096	隷	
2097	齢	齡	
2098	麗	
2099	暦	曆
2102	劣	
2103	烈		
2104	裂		
2105	恋	戀	
2107	廉		
2109	錬	鍊
2110	呂	
2111	炉	爐
2112	賂	
2114	露	
2117	弄	
2118	郎	郞
2120	浪		
2121	廊	廊 [4]	
2122	楼	樓	
2123	漏		
2124	籠	
2127	麓	
2131	賄	
2132	脇	
2133	惑	
2134	枠	
2135	湾	灣
2136	腕	


*/





